Autodesk.Revit.DB.IFC.IFCExtrusionCalculatorOptions.CustomAxis
The custom axis to try (if extrusionAxes includes an option for a custom direction).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.IFC.IFCExtrusionCalculatorOptions.#ctor(Autodesk.Revit.DB.IFC.ExporterIFC,Autodesk.Revit.DB.IFC.IFCExtrusionAxes,Autodesk.Revit.DB.XYZ,System.Double)
Constructs a new instance of a class used to calculate extrusions from Revit geometry.
exporterIFC:
The exporter.
extrusionAxes:
The extrusion axes to try when doing the calculation.
customAxis:
The custom axis to try (if extrusionAxes includes an option for a custom direction).
scale:
The scaling factor for length measurements from the default Revit units to the export units.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2012